#-------------------------------------------
#* ในการรับข้อมูลจาก Keyboard จะใช้คำสั่ง Input 
#-------------------------------------------
input("What’s you name : ")
print("Hello" + input("What’s you name : "))

#|   Ex1.3 จากคำสั่งข้างบน แทนที่จะพิมพ์ชื่อให้พิมพ์จำนวนตัวอักษรแทน
#|   ใช้ google ในการหาวิธี

#-------------------------------------------
#* ในการรับ Input หากเราต้องการเก็บเอาไว้ จะใช้ตัวแปร (Variable)
#-------------------------------------------
name = input("What’s you name : ")

name = "Peter"
print(name)
name = "John"
print(name)

s1 = "Hello"
s2 = "World"
s3 = s1 + s2
print(s3)
print("Hello" + "World")

#| Ex1.4 ให้เปลี่ยนคำสั่งนี้ ให้เป็นแบบที่ใช้ตัวแปร
print("Hello" + input("What’s you name : "))

#| Ex1.5 
#| ให้คัดลอก โปรแกรมด้านล่าง และแก้ไขโดยเมื่อป้อน
#| a: 3
#|
#| b: 5
#| ให้แสดง
#| a: 5
#|
#| b: 3

#-------------------------------------------
# 🚨 Don't change the code below 👇
a = input("a: ")
b = input("b: ")
# 🚨 Don't change the code above 👆

####################################
#Write your code below this line 👇




#Write your code above this line 👆
####################################

# 🚨 Don't change the code below 👇
print("a: " + a)
print("b: " + b)
#-------------------------------------------




""" -------------------------------------------
!หลักการตั้งชื่อตัวแปร
 Camel Case เป็นการตั้งชื่อโดยกำหนดให้คำแรกเป็นตัวอักษรตัวเล็ก
 ทั้งหมด แต่ไม่ได้ใช้อักษรย่อ การตั้งชื่อแบบ Camel Case 
 จะเป็นคำต่อกันทั้งหมด ซึ่งตัวอักษรตัวแรกของคำที่ 2 ขึ้นไป 
 จะเป็นตัวใหญ่

 ? productPrice
 ? summaryResult

 Snake Case แทนที่จะแบ่งคำด้วยตัวอักษรตัวเล็กตัวใหญ่ 
 (case sensitive) การตั้งชื่อแบบนี้จะใช้ _ (Underscore) แทน

 ? product_price
 ? summary_result

 ! และควรตั้งชื่อให้ยาวพอที่จะสื่อความหมาย
 | ตัวเลขไม่สามารถจะอยู่หน้าสุดของตัวแปรได้ 
""" #----------------------------------------------

""" #----------------------------------------------
$ variable = <expression>
* ตัวอักษรตัวแรกต้องเป็นภาษาอังกฤษ
* ชื่อตัวแปรห้ามมีช่องว่าง
* อักษรตัวพิมพ์ใหญ่ และอักษรพิมพ์เล็กมีความแตกต่างกัน
* ควรจะตั้งชื่อให้สื่อกับความหมายใกล้เคียงกับค่าที่จะเก็บ
! ห้ามใช้เครื่องหมายต่อไปนี้ในการตั้งชื่อตัวแปร !,@, #, $, %, ^, &, *, (, ), -, =, \, |, +, ~, .
""" #----------------------------------------------



#|   Ex1.6 รับ 2 บรรทัด คือ ชื่อ กับ จังหวัด 
#|   แสดงเป็น "My name is ... come from ..."





#https://www.google.com/search?q=how+to+get+the+length+of+a+string+in+python+stack+overflow