#---------------------------------------------
#* F string ใช้ในการจัด format
#* การใช้ f-string ทำได้โดยเติม f เปิดไว้ที่ด้านหน้าเครื่องหมาย
#* คำพูด แล้วใช้ {} ล้อมส่วนที่ต้องการแทรกค่าลงไป
#---------------------------------------------

first_name = "ada"
last_name = "lovelace"
full_name = f"{first_name} {last_name}"
message = f"Hello, {full_name}!"
print(message)
print(f"Hello, {full_name}!")

#| Ex 1.13 สมมติว่าเราจะอยู่จนถึงอายุ 90 ปี 
#| คำนวณหา ว่าเราจะมีเวลาเหลืออีกเท่าไร ให้ใช้ f-string
#| Input:
#|      Enter age : 56
#|Output:
#|      You have 12410 days, 1768 weeks, and 408 months left.



#| Ex 1.14 ให้คำนวณว่าโปรโมชั่น มา 4 จ่าย 3 จะจ่ายเท่าไร
#| ให้รับ จำนวนเงินต่อหัว และ จำนวนคนที่ไป 

#---------------------------------------------
#* ในการพิมพ์เราสามารถจัดรูปแบบการพิมพ์ได้ เพื่อความสวยงาม
#---------------------------------------------

print("{}{}".format("th", "Thailand"))
print("{:5}|{:15}|".format("th", "Thailand"))    # align left
print("{:<5}|{:<15}|".format("th", "Thailand"))    # align left
print("{:>5}|{:>15}|".format("th", "Thailand"))  # align right
print("{:*>5}|{:->15}|".format("th", "Thailand"))  # align right
print("{:^5}|{:^15}|".format("th", "Thailand"))  # align center

#---------------------------------------------
#* แบบใช้ f-string
#---------------------------------------------

print(f'{"th"}{"Thailand"}')
print(f'{"th":5}|{"Thailand":15}|')
print(f'{"th":<5}|{"Thailand":<15}|')
print(f'{"th":>5}|{"Thailand":>15}|')
print(f'{"th":*>5}|{"Thailand":->15}|')
print(f'{"th":^5}|{"Thailand":^15}|')

#---------------------------------------------
#* คำสั่ง print มี option อื่นๆ เช่น seperator, end
#---------------------------------------------

print("Hello", "how are you?", sep="---") 

a = 5
print("a = ", a, sep='00000', end='\n\n\n')
print("a = ", a, sep='0', end='\n')

str1 = "Hello"
str2 = "python"
print(str1, end='')
print(str2)

#|Ex.1.15 print คำว่า I'm computer engineer. โดยแยกเป็น 3 บรรทัด 


### ตัวอย่าง : จงเขียนโปรแกรม คำนวณพื้นที่สี่เหลี่ยมผืนผ้า โดยกำหนดตัวแปร
### width และ height โดยรับค่าจาก keyboard
### การแสดงผลให้ใช้ f string ช่วย



#---------------------------------------------
#* การ Input ทีละหลายค่า
#---------------------------------------------
#* กรณีรับ String
#---------------------------------------------
a,b,c = input().split() อ่าน string          # ต้องป้อน 3 ค่าคั่นด้วย space 
#---------------------------------------------
#* กรณีรับ integer
#---------------------------------------------
x,y = [int(e) for e in input().split()]     # ป้อน int x,y 
#---------------------------------------------
#* กรณีรับ float
#---------------------------------------------
a,b,c = [float(e) for e in input().split()]


#| Ex.1.16 อ่านจำนวนจริง 5 จำนวน คั่นด้วยช่องว่าง
#|         คำนวณค่าเฉลี่ยของจำนวนทั้งห้า แล้วแสดงค่าเฉลี่ย

#| Ex.1.17 รับข้อมูล 3 ตัว a, b กับ c คั่นด้วยช่องว่าง
#|         a และ b เป็นตัวอักษรตัวเดียว ส่วน c เป็นจำนวนเต็ม
#|         ให้แสดงตัวอักษรใน a ต่อกับตัวอักษรใน b แล้วตามด้วย c
#|         แล้วตามด้วยตัวอักษร a+b จำนวน c ชุด
#|         เช่น a b 5 -> ab5ababababab



