# %%
"""
$ variable = <expression>
* ตัวอักษรตัวแรกต้องเป็นภาษาอังกฤษ
* ชื่อตัวแปรห้ามมีช่องว่าง
* อักษรตัวพิมพ์ใหญ่ และอักษรพิมพ์เล็กมีความแตกต่างกัน
* ควรจะตั้งชื่อให้สื่อกับความหมายใกล้เคียงกับค่าที่จะเก็บ
! ห้ามใช้เครื่องหมายต่อไปนี้ในการตั้งชื่อตัวแปร !,@, #, $, %, ^, &, *, (, ), -, =, \, |, +, ~, .
"""
#%%
a=1
b=2
c=a+b
print(a+b)
print(c)

# %%
a=1;b=2.0
c=a+b
print(c)

# %%
a= 1<2
print(a)

# %%
a,b = 5,6
print(a+b, a*b)

# %%
a,b = 4,5 
a,b = b,a
print(a,b)

#%%
a=b=c=1
print(a,b,c)

"""
$ จงเขียนโปรแกรม คำนวณพื้นที่สี่เหลี่ยมผืนผ้า โดยกำหนดตัวแปร
# width และ height 
# การแสดงผลให้ใช้ f string ช่วย
"""