question_data = [
    {"text":"กระดาษ 1 รีม มีทั้งหมด 480 แผ่น", "answer": "True"},
    {"text": "ม้าลายมีลายสีดำ", "answer": "False"},
    {"text": "ระบบชลประทานน้ำหยดเป็นความคิดของชาติอิสราเอล", "answer": "True"},
    {"text": "ภาพของพระปรางค์สามยอดอยู่หลังธนบัตรใบละ 500 บาท", "answer": "True"},
    {"text": "เคจีบี. เป็นหน่วยสืบราชการลับของประเทศ USA", "answer": "False"},
    {"text": "วิลเบอร์และออร์วิล ไรท์ พี่น้องชาวอเมริกันสร้างรถยนต์", "answer": "False"},
    {"text": "ทั่วโลกมีโลหะปราสาทอยู่ 3 แห่ง คือ อินเดีย ศรีลังกา และไทย", "answer": "True"},
    {"text": "เลขของโรมัน M เท่ากับจำนวน 10,000", "answer": "False"},
    {"text": "ทองคำแท้มี 18 กะรัต", "answer": "False"},
    {"text": "นครหลวงของทิเบต คือ โปตาลา", "answer": "False"},
    {"text": "ผสมฟลูออรีนลงในน้ำดื่มเล็กน้อย เพื่อป้องกันฟันผุ", "answer": "True"},
    {"text": "อุตสาหกรรมผลิตเบียร์ใช้ข้าวสาลี", "answer": "False"},
    {"text": "ประเทศยูกันดาอยู่ในทวีปแอฟริกา", "answer": "True"},
    {"text": "นกอินทรีเป็นสัญลักษณ์ของสหรัฐอเมริกา", "answer": "True"},
    {"text": "โพไซดอนเป็นเทพยเจ้าแห่งทะเลของ โรมัน ", "answer": "False"},
    {"text": "ป่าที่พระพุทธเจ้าทรงแสดงปฐมเทศนาคือป่าอิสิปตนมฤคทายวัน", "answer": "True"},
    {"text": "แหล่งกำเนิดสุนัขไทยหลังอานอยู่ที่พิษณุโลก", "answer": "False"},
    {"text": "ผงครามที่ใช้ย้อมผ้าทำจากต้นคราม", "answer": "True"},
    {"text": "เมื่อม้าโกรธ หูจะลู่ไปข้างหลัง", "answer": "True"},
    {"text": "เทศกาลหิมะ 'สโนว์ เฟสติวัล' จัดทุกปีในเมืองชิโกกุ", "answer": "False"},
]



