import random

ran = random.randint(1,5)
num = int(input("Enter your number [1-5]:"))
if (ran == num):
    print("You won!")
else:
    print("You lost!")

'''
# จงเขียนโปรแกรมรับข้อมูลจำนวน 2 ค่า คือ 3
# คะแนน midterm และ final
# ถ้าคะแนนรวมกัน > 50 แสดง pass ถ้าต่ำกว่าแสดง fail
'''
score = input("Enter score:")


#%%
a=10
b=20
c=30
#หาความตัวแปรใดที่เก็บค่ามากที่สุด โดยใช้ if 

'''
ในสวนสนุกแห่งหนึ่งมีอัตราการเข้าชมต่างกันตามอายุ
ถ้าต่ำกว่า 4 ขวบ ฟรี 
4-18 = 25
18-65 = 40
> 65 = 20 
จงเขียนโปรแกรมรับอายุแล้วคำนวณจำนวนเงิน
'''

'''
# จงเขียนโปรแกรมรับข้อมูลความเร็ว
# ถ้าน้อยกว่า 45 แสดงผล slow speed
# ถ้าระหว่าง  45 -> 90 แสดงผล moderate speed
# ถ้ามากกว่า 90 ให้แสดงผล fast speed
# กรณีมีหลายเงื่อนไขให้ใช้ and หรือ or เชื่อม
'''

speed = input("Enter speed:")




'''จงเขียนโปรแกรมรับค่าคะแนนเพื่อตัดเกรด เป็น float
โดยให้ปรับเป็นจำนวนเต็มก่อนตัดเกรด 
โดย หาก 0.5 ขึ้นไปให้ปัดขึ้น เช่น 50.7 -> 51
หากน้อยกว่า 50 ให้ปัดลง 50.49 -> 50
จากนั้นค่อยเอามาตัดเกรดดังนี้
< 50 : F
50 -> 55 : D
55 -> 60 : D+
60 -> 65 : C
65 -> 70 : C+
70 -> 75 : B
75 -> 80 : B+
> 80 : A 
'''

'''
จงเขียนโปรแกรม ทอนเงิน เพื่อให้มีจำนวนน้อยที่สุด 
กำหนดจำนวนเงินทอน ไม่เกิน 500 บาท 
มีธนบัตร 100 50 20 
เหรียญ 10 5 1 
ให้แสดงว่าเงินทอนที่ Input ต้องทอนธนบัตร หรือ เหรียญ จำนวนเท่าไร 
'''

"""
การเปรียบเทียบที่ใช้บ่อย
if a%2 == 0 :                           a เป็นเลขคู่หรือไม่
if a%100 == 0 :                         a หารด้วย 100 ลงตัวหรือไม่
if (a//100)%10 == 9 :                   เลขหลักร้อยของ a คือ 9 หรือไม่ หรือ
if (a%1000)//100 == 9:                  ก็เหมือนกัน
if a <= x <= b :                        x มีค่าในช่วงตั้งแต่ a ถึง b หรือไม่

mx = a
if b > mx : mx = b
if c > mx : mx = c
if d > mx : mx = d                      mx เก็บค่ามากสุดของ a,b,c และ d หรือเขียนโดยใช้ฟังก์ชัน max
mx = max(a,b,c,d)                       max(a,b,c,d) หาค่ามากสุดของ a,b,c และ d
"""

'''
เรื่องที่ผิดบ่อย
if x = 0 :

if x != 2 or x != 3 :
            

if x <= 3 and x == 4 :
'''

'''
if s >= 80 :
    g = 'A'
elif 70 <= s < 80 :
    g = 'B'
elif 60 <= s < 70 :
    g = 'C'
elif 50 <= s < 60 :
    g = 'D'
else :
    g = 'F'

สามารถเขียนเป็น

if s >= 80 :
    g = 'A'
elif s >= 70 :
    g = 'B'
elif s >= 60 :
    g = 'C'
elif s >= 50 :
    g = 'D'
else :
    g = 'F'

'''