#-------------------------------------------
#* คำสั่ง if  บางครั้งอาจมีเงื่อนไขที่ต้องพิจารณามากกว่า 1 เงื่อนไข
#* เช่น สมมติว่า การเข้าอุทยานแห่งชาติ มีการแบ่งออกเป็น
#* คนไทย    ผู้ใหญ่ 50 บาท เด็ก 20 บาท
#* ต่างชาติ   ผู้ใหญ่ 100 บาท เด็ก 40 บาท
#* จะเห็นว่ามี 2 เงื่อนไข
#-------------------------------------------

thai_citizen = input("Thai citizen (Y/N) :")
age = int(input("Enter your age : "))

fee=0
if (thai_citizen=='Y'):
    if (age < 18):
        fee = 20
    else:
        fee = 50
else:
    if (age < 18):
        fee = 40
    else:
        fee = 100

print(f"Your admission cost is {fee}.")

#| Ex. 2.5 ปีอธิกสุรทิน หมายถึง ปีที่หารด้วย 4 แต่ปีที่หารด้วย 100 ลงตัวมิใช่ปีอธิกสุรทิน แต่ยกเว้นปีที่หารด้วย 400 ลงตัว
#| ค.ศ. 1600 และ 2000 เป็นปีอธิกสุรทิน แต่ ค.ศ. 1700, 1800 และ 1900 ไม่ใช่ 
#| ให้เขียนโปรแกรมรับปี แล้วบอกว่าเป็น ปีอธิกสุรทิน (Leap year) หรือไม่

year = int(input("Which year do you want to check? "))

#* บางครั้งต้องมีการตรวจสอบหลายเงื่อนไข เราสามารถใช้ 
#* Logical Operator ในการเชื่อมเงื่อนไขได้ 
#* AND จะให้ค่าเป็น True เมื่อทั้ง 2 ข้างเป็น True ทั้งคู่
#* OR จะให้ค่าเป็น False เมื่อทั้ง 2 ข้างเป็น False ทั้งคู่
#* NOT จะให้ค่าตรงข้าม

#| Ex. 2.6 มีตัวแปร 3 ตัว คือ a,b,c (เขียนได้ 2 แบบ)
#| ให้เขียนโปรแกรมหาตัวแปรใดที่เก็บค่ามากที่สุด โดยใช้ if

a=10
b=20
c=30

#| Ex. 2.7 จาก Ex. 2.5 ให้เขียนใหม่ให้มีจำนวนบรรทัดน้อยลง โดยใช้ AND OR NOT 

#-------------------------------------------

def max():
    mx = a
    if b > mx : mx = b
    if c > mx : mx = c

### ตัวอย่าง จงเขียนโปรแกรมตรวจสอบสถานะการโปร
### Probation = GPA ก่อนหน้า > 2.0 และ GPS เทอมปัจจุบัน < 2.0
### หรือ GPA ก่อนหน้า < 2.0 แต่ GPS เทอมปัจจุบัน >= 2.0 แต่ GPA ปัจจุบัน ก็ยัง < 2.0
### ให้ลองเขียน if statement ที่บอกว่าโปรหรือไม่

GPA_prior = 1.8
GPS_Now = 2.1
GPA_Now = 1.9

if GPA_prior >= 2.0:
    status = 'pass'
elif GPS_Now >= 2.0:
    if (GPA_Now > 2.0):
        status = 'pass'
    else:
        status = 'probation'
else:
    status = 'retire'
print(status)

#-------------------------------------------
#*  เรื่องที่ผิดบ่อย
#*  if x = 0 :
#*
#*  if x != 2 or x != 3 :
#*
#*  if x <= 3 and x == 4 :
#-------------------------------------------

#| Ex. 2.8 จงเขียนโปรแกรม ทอนเงิน เพื่อให้มีจำนวนน้อยที่สุด
#| กำหนดจำนวนเงินทอน ไม่เกิน 500 บาท
#| มีธนบัตร 100 50 20
#| เหรียญ 10 5 1
#| ให้แสดงว่าเงินทอนที่ Input ต้องทอนธนบัตร หรือ เหรียญ จำนวนเท่าไร

price = input("Enter price:")


