"""
* หากเราซื้อสลากกินแบ่งเรียงหมายเลขตั้งแต่หมายเลข n1 ต่อเนื่องไปจนถึงหมายเลข n2 (เช่นหมายเลข 10300 ถึง 13999)
* และงวดนี้รางวัลที่ 1 คือหมายเลข p1 เลขท้ายสองตัวคือหมายเลข p2 และ เลขท้ายสามตัวคือหมายเลข p3 เราจะได้รางวัล
* รวมเป็นเงินเท่าไร
*
* กำหนดให้สลากกินแบ่งที่ขายนี้เป็นรุ่นพิเศษ เป็นเลข 5 หลัก รางวัลที่หนึ่ง 10,000 บาท หนึ่งรางวัล รางวัลเลขท้าย
* สองตัวหนึ่งหมายเลข 25 บาท และรางวัลเลขท้ายสามตัวหนึ่งหมายเลข 100 บาท
*
* Input
* จำนวนเต็ม 5 จำนวน p1 p2 p3 n1 n2 คั่นด้วยช่องว่าง
* Output
* เงินรางวัลรวมที่ได้รับ
*
* ตย.
* 01234 11 811 01000 01250 -> 10075
* 19999 13 001 09015 13000 -> 1275
"""
def v1():       #ตรวจสอบเฉพาะรางวัลที่ 1
        """
        ## สนใจเฉพาะรางวัลที่ 1 
        ## ข้อมูลที่จะตรวจสอบ
        # 12345 00 000 12000 13000 -> 10000
        # 12345 00 000 12345 13000 -> 10000  ขอบบน
        # 12345 00 000 12000 12345 -> 10000  ขอบล่าง
        # 12345 00 000 12345 12345 -> 10000  กรณีมีใบเดียว
        # 12345 00 000 12346 14000 -> 0      นอกช่วงซ้าย
        # 12345 00 000 12000 12344 -> 0      นอกช่วงขวา
        """
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input("Input : ").split()]
        s = 0
        if n1 <= p1 <= n2 :
                s += 10000
        print(s)        
def v2():
        """
        ## สนใจเฉพาะเลขท้าย 2 ตัว 
        ## ข้อมูลที่จะตรวจสอบ
        # 00000 50 000 10000 10099 -> 25  
        ! 00000 50 000 10000 10199 -> 50
        ! 00000 50 000 10000 10299 -> 75
        """
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input("Input : ").split()]
        s = 0
        #if n1 <= p1 <= n2 :
        #       s += 10000
        if n1%100 <= p2 <= n2%100 :
                s += 25
        print(s)
def v3():
        """
        ## สนใจเฉพาะเลขท้าย 2 ตัว 
        ## ข้อมูลที่จะตรวจสอบ
        # 00000 50 000 10000 10099 -> 25  
        # 00000 50 000 10000 10199 -> 50
        # 00000 50 000 10000 10299 -> 75
        ! 00000 50 000 10060 10680 -> 150
        """
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input("Input : ").split()]
        s = 0
        #if n1 <= p1 <= n2 :
        #       s += 10000
        if n1//100 == n2//100 :                 # กรณี 3 หลักแรกเท่ากัน
                if n1%100 <= p2 <= n2%100 :     # ถ้าเลขอยู่ในช่วงจะถูก 1 ครั้ง
                        s += 25
        else:                                   # กรณี 3 หลักแรกไม่เท่ากัน
                s += 25*(n2//100 - n1//100 + 1)
        print(s)
def v4():
        """
        ## สนใจเฉพาะเลขท้าย 2 ตัว 
        ## ข้อมูลที่จะตรวจสอบ
        # 00000 50 000 10000 10099 -> 25
        # 00000 50 000 10000 10199 -> 50
        # 00000 50 000 10000 10299 -> 75
        # 00000 50 000 10060 10680 -> 150
        """
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input("Input : ").split()]
        s = 0
        #if n1 <= p1 <= n2 :
        #       s += 10000
        if n1//100 == n2//100 :                 # กรณี 3 หลักแรกเท่ากัน
                if n1%100 <= p2 <= n2%100 :     # ถ้าเลขอยู่ในช่วงจะถูก 1 ครั้ง
                        s += 25
        else:                                   # กรณี 3 หลักแรกไม่เท่ากัน
                if n1%100 <= p2 :               # 1) เลข 2 หลักหลังใบแรก <= เลขท้าย 2 ตัว 
                        s += 25                 # บวก 25 
                if p2 <= n2%100 :               # 2) เลข 2 หลักหลังใบสุดท้าย >= เลขท้าย 2 ตัว
                        s += 25                 # บวก 25
                s += 25*((n2//100-1) - \
                        (n1//100+1) + 1)        # ส่วนที่อยู่เต็ม 100 ใบ 
        print(s)
def v5():
        """
        ## สนใจเฉพาะเลขท้าย 2 ตัว 
        ## ข้อมูลที่จะตรวจสอบ
        # 00000 50 000 10000 10099 -> 25
        # 00000 50 000 10000 10199 -> 50
        # 00000 50 000 10000 10299 -> 75
        # 00000 50 000 10060 10680 -> 150
        """
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input("Input : ").split()]
        s = 0
        #if n1 <= p1 <= n2 :
        #       s += 10000
        if n1%100 <= p2 :               # 1) เลข 2 หลักหลังใบแรก <= เลขท้าย 2 ตัว 
                s += 25                 # บวก 25 
        if p2 <= n2%100 :               # 2) เลข 2 หลักหลังใบสุดท้าย >= เลขท้าย 2 ตัว
                s += 25                 # บวก 25
        s += 25*((n2//100-1) - \
                (n1//100+1) + 1)        # ส่วนที่อยู่เต็ม 100 ใบ 
        print(s)
def v6():
        """
        ## สนใจเฉพาะเลขท้าย 3 ตัว 
        ## ข้อมูลที่จะตรวจสอบ
        01234 11 811 01000 01250 -> 10075
        99999 99 999 99950 99999 -> 10125
        19999 13 001 09015 13000 -> 1275
        """
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input("Input : ").split()]
        s = 0
        if n1 <= p1 <= n2 :
                s += 10000
        if n1%100 <= p2 :
                s += 25
        if p2 <= n2%100 :
                s += 25
        s += 25*(n2//100 - n1//100 - 1)
        if n1%1000 <= p3 :
                s += 100
        if p3 <= n2%1000 :
                s += 100
        s += 100*(n2//1000 - n1//1000 - 1)
        print(s)

v6()

