#-------------------------------------------
#* ในการใช้งานบางงาน เราอาจใช้วิธี "นำเข้า" โปรแกรม
#* ที่ผู้อื่น หรือ ตัวเองเขียนที่อยู่ในไฟล์อื่น เรียกว่า "โมดูล"
#
#* ใช้คำสั่ง import module
#
#* โมดูลแรกที่จะลองใช้ คือ random ซึ่งใช้สุ่มเลข

import random 

random_side = random.randint(0,1)
# คำสั่ง randint(start,stop) จะสุ่มจำนวนเต็มตั้งแต่ start - stop
if random_side == 1:
    print("Heads")
else:
    print("Tails")

#| Ex.2.9 จงเขียนโปรแกรมเป่ายิงฉุบ 
#| โดยให้รับข้อมูลจาก User จำนวน 1 ตัวเป็น 1 ) Rock, 2) Paper, 3) Scissors
#| จากนั้นให้คอมพิวเตอร์สุ่มเลือกอีกข้าง

rock = '''
    _______
---'   ____)
      (_____)
      (_____)
      (____)
---.__(___)
'''

paper = '''
    _______
---'   ____)____
          ______)
          _______)
         _______)
---.__________)
'''

scissors = '''
    _______
---'   ____)____
          ______)
       __________)
      (____)
---.__(___)
'''