"""
ในการใช้ if ความยากอย่างหนึ่ง คือ กรณีเจอเงื่อนไขที่ซับซ้อน 
โดย Operator ที่ใช้ได้ คือ 
! หมายถึง Not
AND หมายถึง และ
OR หมายถึง หรือ 

การเขียนโปรแกรม if-else ควรตรวจสอบทีละเงื่อนไข
"""

# Probation = GPA ก่อนหน้า > 2.0 และ GPS เทอมปัจจุบัน < 2.0
# หรือ GPA ก่อนหน้า < 2.0 แต่ GPS เทอมปัจจุบัน >= 2.0 แต่ GPA ปัจจุบัน ก็ยัง < 2.0
# ให้ลองเขียน if statement ที่บอกว่าโปรหรือไม่

GPA_prior = 1.8
GPS_Now = 2.1
GPA_Now = 1.9

"""
ปีอธิกสุรทิน หมายถึง ปีที่หารด้วย 4 แต่ปีที่หารด้วย 100 ลงตัวมิใช่ปีอธิกสุรทิน แต่ยกเว้นปีที่หารด้วย 400 ลงตัว
ค.ศ. 1600 และ 2000 เป็นปีอธิกสุรทิน แต่ ค.ศ. 1700, 1800 และ 1900 ไม่ใช่ 
ให้เขียนโปรแกรมรับปี แล้วบอกว่าเป็น ปีอธิกสุรทิน (Leap year) หรือไม่
"""



"""
รับจำนวนเต็ม 5 จำนวน คั่นด้วยช่องว่าง
ตรวจว่าลำดับจากซ้ายไปขวาของจำนวนที่รับมา
เรียงจากน้อยไปมากหรือไม่
ตอบ True, False
"""

"""
รับจำนวนเต็ม 4 จำนวน คั่นด้วยช่องว่าง
หาผลรวมของจำนวนที่รับมา โดยไม่รวมจำนวนที่
มากสุด และ น้อยสุด
"""

"""
หากเราซื้อสลากกินแบ่งเรียงหมายเลขตั้งแต่หมายเลข n1 ต่อเนื่องไปจนถึงหมายเลข n2 (เช่นหมายเลข 10300 ถึง 13999)
และงวดนี้รางวัลที่ 1 คือหมายเลข p1 เลขท้ายสองตัวคือหมายเลข p2 และ เลขท้ายสามตัวคือหมายเลข p3 เราจะได้รางวัล
รวมเป็นเงินเท่าไร

กำหนดให้สลากกินแบ่งที่ขายนี้เป็นรุ่นพิเศษ เป็นเลข 5 หลัก รางวัลที่หนึ่ง 10,000 บาท หนึ่งรางวัล รางวัลเลขท้าย
สองตัวหนึ่งหมายเลข 25 บาท และรางวัลเลขท้ายสามตัวหนึ่งหมายเลข 100 บาท

Input
จำนวนเต็ม 5 จำนวน p1 p2 p3 n1 n2 คั่นด้วยช่องว่าง
Output
เงินรางวัลรวมที่ได้รับ

ตย.
01234 11 811 01000 01250 -> 10075
19999 13 001 09015 13000 -> 1275
"""
def v1():       #ตรวจสอบเฉพาะรางวัลที่ 1 
        '''
        ข้อมูลที่จะตรวจสอบ 
        '''
        p1,p2,p3,n1,n2 = \
        [int(e) for e in input().split()]
        s = 0
        if n1 <= p1 <= n2 :
                s += 10000
        print(s)        



