# TODO: มี Class อะไรบ้าง

# Task 1 : สร้าง Screen ขนาด 800 x 600
# Task 2 : สร้างไม้ตี (Paddle) อันที่ 1 ขนาด 20 x 100 ตำแหน่ง (350,0)
#          กด Up, Down เป็นการเลื่อนครั้งละ 20 pixel
#          ใช้คำสั่ง Turtle.shape และ Turtle.shapesize
#          และต้องไม่ให้เลยขอบออกไป
#          เสร็จแล้วให้ refactor เปลี่ยนเป็น Class Paddle
# Task 3 : สร้างไม้ตี (Paddle) อันที่ 2
#          ใช้ w, s ในการควบคุม
# Task 4 : สร้างบอล และ สั่งให้เคลื่อนไหว ขนาด 20 x 20 เริ่มต้นตำแหน่ง 0,0
#          ในการเคลื่อนที่ของบอลครั้งแรกให้ x+10, y+10
# Task 5 : ถ้าบอลกระทบกำแพงบนหรือล่าง ให้เด้ง
#          คำแนะนำ : เปลี่ยนจาก บวกเป็นลบ
# Task 6 : ตรวจสอบว่าบอลกระทบไม้ตี
#          คำแนะนำ : เช็คขอบเขตของไม้ตี จะดีกว่าการใช้ distance
# Task 7 : ตรวจสอบว่า บอลทะลุไม้ตีออกไป
# Task 8 : เก็บคะแนน



