#---------------------------------------------------
#* String มี Function ให้ใช้มากมาย
#* วิธีการใช้ Function ของ String จะใช้ .function หลังตัวแปร
#---------------------------------------------------

#---------------------------------------------------
#* upper() แปลงเป็นตัวใหญ่
#* lower() แปลงเป็นตัวเล็ก
#---------------------------------------------------
name = "Ada Lovelace"
print(name.upper())
print(name.lower())

#---------------------------------------------------
#* การตัดช่องว่าง หน้า-หลัง
#* ในการทำงาน บางครั้งเวลาเราเปรียบเทียบ string ถ้ามีช่องว่าง หน้าหรือหลังจะมองว่าไม่เท่ากัน
#* strip() ตัดช่องว่าง หน้า หลัง
#* rstrip() ตัดช่องว่าง หลัง
#* lstrip() ตัดช่องว่าง หน้า
#---------------------------------------------------

favorite_language = 'python ' 
print(favorite_language+':')
print(favorite_language.rstrip()+':')

favorite_language = ' python '
print(':'+favorite_language)
print(':'+favorite_language.lstrip())

#---------------------------------------------------
#* เราสามารถใช้ String Function ต่อกันได้ด้วย
#---------------------------------------------------
s = " Python 3.6 "
s = s.strip().upper()
print(s)

#---------------------------------------------------
#* การแปลงค่าระหว่างชนิด
#* การแปลงค่าจาก str เป็น int
#* int(number, base=base)
#---------------------------------------------------
print(int("10"))            # 10
print(int("10",base=2))     # 2

#---------------------------------------------------
#* การแปลงค่าจาก int เป็น str
#---------------------------------------------------
num = 123
print(str(num))         # '123'

#---------------------------------------------------
#* สามารถนำตัวแปรมาแสดงผลหลายครั้งก็ได้
#---------------------------------------------------
num=3
print (f'Hello, {num}')
print (f'Hello, {num}{num}')
print (f'Hello, {num}{num}{num}')

#---------------------------------------------------
#*กรณีที่ข้อมูลเป็นชุดที่คั่นด้วยตัวอักษร สามารถแยกด้วยฟังก์ชัน split เช่น
#*โดยผลลัพธ์จะอยู่ใน List
#---------------------------------------------------

text= 'Love thy neighbor'

# splits at space
print(text.split())

grocery = 'Milk, Chicken, Bread'

# splits at ','
print(grocery.split(', '))

# Splits at ':'
print(grocery.split(':'))

#---------------------------------------------------
#*การรวมชุด string ที่คั่นด้วย , จะใช้ join
#---------------------------------------------------

# .join() with lists
numList = ['1', '2', '3', '4']
separator = ', '
print(separator.join(numList))

s1 = 'abc'
s2 = '123'

# each element of s2 is separated by s1
# '1'+ 'abc'+ '2'+ 'abc'+ '3'
print('s1.join(s2):', s1.join(s2))

# each element of s1 is separated by s2
# 'a'+ '123'+ 'b'+ '123'+ 'b'
print('s2.join(s1):', s2.join(s1))

#---------------------------------------------------
#*การค้นหา string 
#* k = s.find(c) คืน index น้อยสุดที่พบ c ใน s 
#* เริ่มต้นตั้งแต่ index 0 ถ้าไม่พบ จะได้ผลเป็น -1
#---------------------------------------------------

k = "engineering".find("ng")
print(k)

#* if c in s เหมือนกับ if s.find(c) >= 0

#---------------------------------------------------
#*การแทนที่ string
#---------------------------------------------------
s1 = "Python Programming"
print(s1[:6])
print(s1.replace("Programming", "Language"))

#---------------------------------------------------
#*การ split string
#---------------------------------------------------
my_str = "Hello this Is an Example with The word oders"
words = my_str.split()

#---------------------------------------------------
#*การ เรียงข้อมูลใน list 
#---------------------------------------------------
words.sort()
print("The sorted words are:")
for word in words:
   print(word)

#---------------------------------------------------
#* ในกรณีที่เราต้องการทราบว่า String เป็นตัวเลขหรือไม่ สามารถใช้ฟังก์ชันได้ 
#---------------------------------------------------

str = "a1b2c3"
print(str.isdigit())
str = "123"
print(str.isdigit())







